"use strict";

const result = [
  {
    Keyword: "water",
    Name: "Water",
    ReagentProperty: {
      id: "6037db814aa7b285bfdb14bf",
      casNo: "7732-18-5",
      formula: "H2O",
      molecularWeight: "18.015",
      meltingpoint: "0 °C",
      boilingpoint: "99.974 °C",
      density: "0.9950 g/cu cm at 25 °C",
    },
    MaterialSafety: null,
  },
  {
    Keyword: "benzene",
    Name: "Benzene",
    ReagentProperty: {
      id: "603ca69d009a43107891099d",
      casNo: "71-43-2",
      formula: "C6H6",
      molecularWeight: "78.11",
      meltingpoint: "5.5 °C",
      boilingpoint: "80.0 °C",
      density: "0.8756 g/cu cm at 20 °C",
    },
    MaterialSafety: {
      id: "6037dd0f4aa7b2889bcda6fb",
      casNo: "71-43-2",
      phyStatus: "액체(5.56 ℃ 이하에서는 고체)",
      phyColor: "무색에서 밝은 노란색\n투명",
      phySmell:
        "벤젠은 독특한 방향성 냄새를 가지고 있지만, 경고용 속성으론 부적합함\n100 ppm이 0의 자극등급을 가지고 있고, 1~2 사이의 냄새 강도를 가지고 있기 때문임\n4.68 ppm\n4.9 mg/m3(특유의 냄새, 공기)\n2.0 ppm(물)",
      phyTaste: "물에서의 맛 역치 : 0.5-4.5 ppm",
      NFPAHealthNum: "2",
      NFPAFireNum: "3",
      NFPAReactionNum: "0",
      NFPASpecialNum: "자료없음",
      NFPAHealth:
        "2 (노출지역에 눈보호가 되는 호흡장치만 착용하면 들어갈 수 있는 유해성 물질)",
      NFPAFire:
        "3 (상온에서 쉽게 점화될 수 있는 물질, 비교적 입자가 큰 분진상태의 고체, 강한 화염을 내며 탈 수 있는 섬유상, 분말상의 고체, 산소를 자체에 포함하는 물질로 연소가 매우 빠른 고체, 상온의 공기중에서 자연발화 할 수 있는 고체)",
      NFPAReaction: "0 (화재에 노출되어도 안전, 물과 반응하지 않는 물질)",
      NFPASpecial: "자료없음",
      safReaction:
        "벤젠은 에틸 알루미늄 다이클로라이드 또는 에틸 알루미늄 세스퀴클로라이드 존재시 -70 ℃ 조차에서도 염화 알릴 또는 다른 알킬 할라이드류와 활발히 반응함\n폭발이 일어남\n분말 크롬산 무수물과 접촉시 점화됨\n질산과 같은 산화제류와 혼합금지해야 함\n삼플루오르화 브롬, 오플루오르화 브롬, 오플루오르화 요오드, 칠플루오르화 요오드와 다른 할로겐류와의 혼합물류는 가열시 점화됨\n벤젠과 사이아노겐 할라이드류는 부산물로서 염화수소(HCl)을 얻음\n벤젠과 트라이클로로아세토나이트라일의 반응은 독성 클로로폼과 염화수소(HCl) 가스를 진화시킴\n사이클로헥세인으로 벤젠의 수소화는 210-230 ℃에서 고정된 반응기에 영향을 받을 수 있으나 전환 감소가 분명했음. 10 ℃까지 온도를 증가시키고, 수소 흐름은 냉각 코일 사이에 끼우는 것은 취급할 수 없는 반응속도에 큰 증가를 일으킴\n벤젠은 요오드 헵타플루오라이드 기체와 접촉시 점화함\n다이옥시제닐 테트라플루오로보레이트는 매우 강산화제이며, 상온에서 벤젠의 작은 샘플에 작은 입자를 첨가하면 점화를 일으킴\n플루오르화 이산소 내에 이플루오라이화 이산소의 2 % 용액은 -78 ℃에서 고체 벤젠을 점화시킴\n벤젠은 분말 크롬산 무수물과 접촉시 점화함\n벤젠 증기와 염소(우연히 혼합됨)의 폭발은 빛에 의해 개시되었음\n다이보레인의 자연 폭발 반응에 대기에서 수분 또는 벤젠 증기 존재시 영향이 연구되었음",
      safCorrosion: "자료없음",
      safAvoid:
        "점화의 위험이 있으므로 산화제에 의한 오염을 피해야함. 즉 질산염(nitrates), 산화성산(oxidising acids), 염소 표백제(chlorine bleaches), 염소계 살균제(pool chlorine) 등\n강산화제류, 많은 플루오라이드류와 과염소산염류, 질산",
      humNormal:
        "홍조, 쇠약, 두통, 숨막힘, 흉부 압박, 메스꺼움과 구토에 이어 어지러움, 흥분, 창백함이 나타남. 혼수상태와 사망 유발 가능\n눈, 피부, 코, 호흡계 자극; 어지러움; 두통, 메스꺼움, 갈지자걸음, 식욕부진, 무기력(쇠약, 탈진); 피부염; 골수 억제; [잠재적인 작업장 발암물질]",
      humInhale:
        "중간 정도의 피부 자극을 일으킴\n유해한 양이 피부를 통해 흡수될 수 있음\n이 액체와 직접 접촉되면 홍반과 물집형성을 일으킬 수 있음\n장기 또는 반복 접촉은 건성 비늘로 뒤덮인 피부염 또는 2차 감염 발현과 관련되어 있음\n반복 노출은 홍반, 부어오름, 수포 등의 접촉성 피부염을 유발시킬 수 있음\n피부 접촉은 유해한 건강 영향을 유발시키지 않는 것으로 간주함(동물 모델을 이용한 EC Directives 분류 기준으로서); 이 물질은 상처, 외상, 찰과상을 입은 부분을 통해 침투되면 건강 손상을 유발시킬 수 있음\n이 물질을 베인 상처, 찰과상 또는 자극을 일으킨 피부에 노출시키지 말 것\n베임, 찰과상 또는 환부를 통하여 혈액 속에 들어갈 경우, 유해한 영향과 함께 전신 손상을 유발할 수 있음\n물질 사용에 앞서, 피부를 검사하고, 모든 외상으로 부터 적절히 보호할 것\n피부 흡수는 독성 영향을 유발시킬 수도 있음\n피부표시의 노출 한계는 증기상 물질과 액체는 피부접촉을 통해 흡수될 수 있음을 가리킴\n피부를 통한 흡수는 증기 흡입 노출을 쉽게 초과할 수 있음\n피부흡수의 증상은 흡입했을 때와 같음\n눈과 점막에 접촉하여 전체 노출에 기여할 수 있으며, 이는 노출 기준을 무효화할 수 있음",
      humSkin:
        "중간 정도의 피부 자극을 일으킴\n유해한 양이 피부를 통해 흡수될 수 있음\n이 액체와 직접 접촉되면 홍반과 물집형성을 일으킬 수 있음\n장기 또는 반복 접촉은 건성 비늘로 뒤덮인 피부염 또는 2차 감염 발현과 관련되어 있음\n반복 노출은 홍반, 부어오름, 수포 등의 접촉성 피부염을 유발시킬 수 있음\n피부 접촉은 유해한 건강 영향을 유발시키지 않는 것으로 간주함(동물 모델을 이용한 EC Directives 분류 기준으로서); 이 물질은 상처, 외상, 찰과상을 입은 부분을 통해 침투되면 건강 손상을 유발시킬 수 있음\n이 물질을 베인 상처, 찰과상 또는 자극을 일으킨 피부에 노출시키지 말 것\n베임, 찰과상 또는 환부를 통하여 혈액 속에 들어갈 경우, 유해한 영향과 함께 전신 손상을 유발할 수 있음\n물질 사용에 앞서, 피부를 검사하고, 모든 외상으로 부터 적절히 보호할 것\n피부 흡수는 독성 영향을 유발시킬 수도 있음\n피부표시의 노출 한계는 증기상 물질과 액체는 피부접촉을 통해 흡수될 수 있음을 가리킴\n피부를 통한 흡수는 증기 흡입 노출을 쉽게 초과할 수 있음\n피부흡수의 증상은 흡입했을 때와 같음\n눈과 점막에 접촉하여 전체 노출에 기여할 수 있으며, 이는 노출 기준을 무효화할 수 있음",
      humEye:
        "심한 눈 자극을 일으킴\n약한 일시적인 손상을 일으킬 수 있음\n이 물질은 일부 사람에게 눈 자극을 일으키고, 점안 24시간 이후 눈 손상을 일으킬 수 있다는 증거가 있음\n통증과 함께 심한 염증이 나타날 것으로 예상됨\n각막을 손상시킬 수 있음\n응급처치가 바로 이루어지지 않으면 시력을 영원히 잃을 수 있음\n반복 노출은 결막염을 일으킬 수 있음",
      humMouth: "자료없음",
      humEtc: "자료없음",
      emeInhale:
        "즉시 오염 지역을 벗어나, 신선한 공기를 깊게 호흡하게 할 것\n기침이나 호흡 곤란, 입, 후두나 가슴이 타는 듯한 느낌 등과 같은 증상이 없더라도, 즉시 의사를 호출하고, 병원으로 환자를 옮길 준비를 할 것\n확인되지 않은 대기조건에서, 환자를 구조하는 경우 적절한 호흡 보호 장치를 제공할 것\n자급식 공기호흡기를 사용가능하다면 사용하고, 그렇지 않은 경우에는 보호의에 권고된 이상의 보호 단계로 조치할 것\n즉시 의사의 도움을 받을 것\n노출을 피해 즉시 신선한 공기가 있는 곳으로 이동 시킬 것\n호흡이 곤란하면, 산소를 공급할 것\n구강 대 구강 인공호흡은 피할 것\n호흡 정지 시, 산소와 백 및 마스크와 같은 적절한 의학 장비를 이용하여 인공호흡을 실시할 것",
      emeSkin:
        "오염된 옷을 제거하고 격리하는 동안, 즉각 다량의 물로 노출된 피부를 씻어낼 것\n모든 노출 부위를 비누와 물로 천천히 씻어낼 것\n홍반이나 자극과 같은 증상이 없더라도 즉시 병원이나 중독관리센터에 전화를 할 것\n노출된 부위를 씻은 뒤, 치료를 위해 환자를 병원으로 즉시 옮길 것\n즉시 의사의 도움을 받을 것\n즉시 다량의 물과 비누를 사용하여 적어도 15분 정도 씻어내고 오염된 옷과 신발을 제거할 것\n옷은 재사용 전에 세탁할 것",
      emeEye:
        "우선, 환자의 콘택트 렌즈 착용여부를 확인하고 착용 시 제거할 것\n환자의 눈을 물 또는 생리식염수로 20-30분간 씻어주면서, 동시에 병원 또는 중독관리센터에 연락을 취할 것\n의사의 지시가 없이, 환자의 눈에 연고, 오일 또는 다른 약물을 투여하지 말 것\n홍반이나 자극과 같은 증상이 없더라도, 눈을 씻어낸 후, 즉시 병원으로 환자를 옮길 것\n종종 눈꺼풀을 위아래로 들어올려, 최소한 15분 정도, 다량의 물로 눈을 씻을 것\n즉시 의사의 도움을 받을 것",
      emeMouth:
        "구토를 유도하지 말 것\n휘발성 물질은 구토 중 폐로 흡인됨으로써 의학적 문제를 야기시킬 위험이 높음\n환자가 의식이 있으면서 경련하지 않으면, 화학물질을 희석하기 위해서 물을 1 내지 2잔을 주고, 즉시 병원이나 중독관리센터에 전화할 것\n즉시 환자를 병원으로 수송할 것\n만약 환자에게 경련이 있거나 의식이 없으면, 입으로 어떤 것도 공급해서는 안 되고, 환자의 기도를 열고, 한쪽 옆으로 머리를 몸 보다 낮게 하여 눕힐 것\n환자가 의식이 있으면, 2~4컵 정도 우유나 물을 줄 것\n의식이 없다면 절대 어떤 것도 주지 말 것",
      emeEtc:
        "이 물질은 발암물질로 알려져 있거나 의심되므로, 반드시 의사를 만나 장기적으로 건강에 미칠 수 있는 영향과 의학적 감시를 통해 잠재적인 권고사항에 대해 조언을 받을 것\n의사는 특정 성분, 그 성분의 화합물, 물리화학적 특성 및 독성 , 노출 수준, 노출 시간, 노출 경로를 조사할 것",
      accLeakage:
        "모든 점화원을 제거할 것(흡연, 불꽃, 스파크나 화염)\n제품 취급 시 사용하는 모든 장비는 반드시 접지할 것\n유출된 물질 위를 걷거나 만지지 말 것\n만약 위험하지 않다면 누출을 멈추게 할 것\n수로, 하수, 지하실 또는 밀폐된 장소로 들어가는 것을 방지할 것\n증기발생을 줄이기 위해 증기억제 폼(foam)을 사용할 수 있음\n건토, 건사 또는 비가연성 물질로 덮어 흡수시킨 후 용기에 수거하여 옮길 것\n흡수된 물질을 모으기 위해 스파크가 일어나지 않는 깨끗한 도구를 사용할 것\n소규모 유출-모든 유출물은 즉각적으로 수거할 것-증기 흡입이나 피부, 눈과의 접촉을 피할 것 -보호장비를 착용하고 개인 접촉을 통제할 것 -소량 유출의 경우 질석 또는 기타 흡수제에 흡수시킨 후 용기에 수거할 것-잔류물은 닦아낼 것-폐 용기 내에 남아있는 인화성 잔류물은 수거할 것\n대규모 유출-액체유출의 경우 처리를 위해 도랑을 파거나 제방을 쌓을 것-화재 진압 시 물 스프레이의 사용이 증기를 줄일 수는 있으나 닫힌 공간에서의 점화는 막을 수 없음-화학물질 등급: 방향족 탄화수소류-육지에 누출된 경우, 우선순위 목록에 있는 권장 흡수제를 사용할 것-사람들의 접근을 막고 풍상지역(맞바람이 부는 곳)으로 이동할 것 -소방서에 신고하여 위치와 위험성을 알릴 것-격렬하고 폭발적인 반응이 일어날 수 있음-호흡기와 보호장갑을 착용할 것 -모든 가능한 방법을 동원해 유출액이 하수구나 수계로 흘러 들어가는 것을 막을 것 -대피로 또는 보호지역을 확보할 것-환기를 강화할 것-물 스프레이 또는 물분무가 증기 흡수를 위한 분산제로 사용될 수 있음-유출물 수거 시에는 스파크가 발생하지 않는 삽과 방폭 장비를 사용할 것-회수 가능한 물질은 재활용을 위해 라벨을 부착한 용기에 수집할 것-잔류물은 모래, 흙 또는 질석에 흡수시킬 것-고체 잔류물은 처리를 위해 라벨을 부착한 드럼통에 수거하여 밀봉할 것-오염지역을 청소한 처리수가 하수구로 흘러 들어가지 않도록 주의할 것-만약 하수나 수로에 오염이 발생했다면 비상 대응기관에 알리고 자문을 구할 것",
      accFire:
        "유출을 멈추게 할 수 없다면 혹은 안전하게 차단 할 수 없다면, 소화시도 하지 말 것\n직수 분사는 불을 번지게 할 수 있음\n화재에 노출된 용기는 다량의 물로 냉각시킬 것\n가능한 멀리서 물을 뿌릴 것\n소방서에 신고하여 화재위치와 위험성을 알릴 것\n격렬하게 또는 폭발적으로 반응할 수 있음\n호흡보호구가 장착된 전신 보호복을 착용할 것\n모든 수단을 동원해, 수로나 배수구로의 유출을 차단할 것\n대피를 고려할 것 (혹은 보호 할 것)\n안전거리를 유지하며 적절한 보호 하에 화재를 진압할 것\n만약 안전하게 할 수 있다면 증기로 인한 화재 위험이 제거 될 때 까지 전기 장치들의 스위치를 꺼둘 것\n미세한 물분무로 화재를 진압하고 인접 지역을 냉각시킬 것\n누출액체가 고여있는 웅덩이에 물을 뿌리지 말 것\n뜨거울 것으로 의심되는 용기에는 접근하지 말 것",
      treStorage:
        "열, 스파크, 화염과 가까이 두지 말 것\n점화원과 가까이 두지 말 것\n확실하게 밀폐된 용기에 저장할 것\n산화물질과 접촉을 피할 것\n서늘하고 건조하고 통풍이 잘 되는 장소에서 혼합금지물질과 떨어진 곳에 저장할 것\n승인된 화염 보호 구역에서 원래의 용기에 저장할 것\n금연하고 갓이 없는 등, 열이나 점화원은 제거할 것\n구덩이나 움푹 파인 땅, 지하실 등 증기가 갇힐 수 있는 곳에 저장하지 말 것\n물리적 손상으로부터 용기를 보호하고 정기적으로 누수를 확인할 것\n저장 및 취급시, 제조자의 권고사항을 살펴볼 것",
      treTreatcaution:
        "취급 후, 손을 철저하게 씻을 것\n오염된 옷은 버리고 재사용하기 전에 세척할 것\n물질을 이동시킬 때 용기를 땅에 밀착하여 이동할 것\n분진, 증기, 미스트나 가스를 흡입하지 말 것\n눈, 피부 및 옷과 접촉하지 않도록 할 것\n빈 용기에는 잔류물이 있을 수 있어 위험할 수 있음\n용기를 완전히 밀폐시킬 것\n열, 스파크, 화염과의 접촉을 피할 것\n섭취나 흡입하지 말 것\n화학물질 흄 후드 내에서만 취급할 것\n가압, 절단, 용접, 납땜, 연마, 천공을 해서는 안 되며, 열, 스파크, 화염에 빈 용기를 노출시키지 말 것\n빈 용기라 하더라도 폭발성의 기체를 포함하고 있을 수 있음\n용기 근처에서 가압, 절단, 용접, 납땜, 연마, 천공을 해서는 안됨\n물질에 젖은 옷을 착용한 상태로 피부접촉하지 말 것\n펌프시, 정전기가 발생할 수도 있음-이는 화재를 유발시킬 수도 있음\n모든 장치는 접지해야 함\n정전기 발생을 피하기 위해 펌프 사용시 선속도 규정을 준수하도록 함(직경의 두배로 파이프에 물을 채울 때까지 1 m/sec 이하, 그 다음에 7 m/sec 이하)\n충전재가 튀는 것을 피할 것\n작업 중 일 때 압축된 공기를 사용하지 말 것\n흡입을 포함한 모든 인체 접촉은 피할 것\n노출 위험이 발생할 때, 보호의를 착용할 것\n통풍이 잘 되는 장소에서 사용할 것\n움푹한 곳에 모이지 않도록 할 것\n대기상태가 확인될 때까지 밀폐된 공간으로 들어가지 말 것\n흡연, 직사광선, 열이나 점화원을 피할 것\n증기상물질은 끌어올리거나 쏟아부을 때, 정전기로 인해 점화될 수 있음\n플라스틱 용기를 사용하지 말 것\n제품을 나누거나 쏟아부을 때, 금속용기를 접지하여 안전하게 할 것\n취급 시 스파크가 없는 도구를 사용할 것\n혼합금지물질과 접촉시키지 않을 것\n용기를 안전하게 밀폐시킬 것\n용기에 물리적인 위험을 피할 것\n작업복은 분리하여 세탁할 것\n적합한 작업장을 사용할 것\n저장 및 취급시, 제조자의 권고사항을 살펴볼 것\n안전한 작업환경을 유지하기 위하여 대기 노출 기준을 준수할 수 있도록 공기질을 정기적으로 확인할 것<저장시 주의사항>\n방향족 고리와 강산화제의 접촉으로 인해 때때로 폭발에 이르는 격렬한 반응이 일어날 수 있음\n방향족은 환원제 및 다이아조 화합물과 발열반응함\n벤젠-아이오딘 펜타플루오라이드와 격렬히 반응함-사이클로헥세인에 수소 210-230 ℃ 추가시 고정층 반응기에 영향을 주지만 변환시 내려감; 수소 교류시 취급할 냉각 코일 사이에 키울 모판 온도를 10 ℃증가시키며 반응 비율을 크게 증가 시킬 수 있음; 280 ℃로 발열 반응은 600 ℃ 팽창 반응기 벽 주위에 열점이 발달됨-아이오딘 헵타플루오라이",
      treDisposal:
        "폐기방법 : 폐기물관리법에 명시된 경우 규정에 따라 내용물 및 용기를 폐기하시오.\n폐기시 주의사항 : 폐기물관리법에 명시된 경우 규정에 명시된 주의사항을 고려하시오.\n빈 용기에도 남아있는 물질로 인한 화학적 유해성이나 위험성이 존재할 수 있음\n가능하다면 재사용/재활용을 위해 공급자에게 반환할 것\n다른 경우 : 만약 다 쓴 빈 용기를 잔여물 없이 충분히 깨끗하게 세정할 수 없거나 동일물질을 저장하는데 사용할 수 없다면, 재사용을 막기 위해 용기에 구멍을 뚫고 허가된 매립지에 매립할 것\n가능한 라벨의 경고문과 MSDS 등 제품 내 딸려있는 모든 고지사항을 준수할 것\n폐기물 처리 요건에 대한 법은 나라, 지역마다 다를 수 있음\n사용자는 그 지역의 법을 따라야 함. 일부 지역에서는 특정 폐기물에 대한 추적이 행해지고 있음\n규제의 체계는 일반적일 것으로 보이며, 사용자의 조사가 필요함:\n환원\n재사용\n재활용\n폐기(앞의 항목들이 가능하지 않은 경우)\n사용하지 않았거나 오염되지 않은 물질의 경우 재활용이 가능할 수 있음. 물질의 유효기간을 고려하여 재활용 및 재생 여부를 결정할 것. 물질의 성질은 사용 중 변할 수 있으며, 재사용 또는 재활용이 항상 적절한 것이 아닐 수 있음\n장비세척 시 생성된 세척수를 하수구로 흘려보내지 말 것\n폐기 전에 처리로 인한 세척수를 수거할 필요성이 있을 수도 있음\n하수구로 폐기 시 그 지역의 법이나 규정에 적합한지 가장 먼저 고려할 것. 의심스러울 경우 관련 당국 책임자에게 문의할 것\n의문사항은 책임자와 상의할 것\n가능한 장소 어디에서든 재활용할 것\n만약 적합한 처리방법이나 처리 시설이 없다면 제조업자에게 재활용 방안에 대해 문의하거나 지역 폐기물 관리자에게 자문을 구할 것\n폐기 방법 : 화학물질 및/또는 약품 폐기물을 허용하기위해 특별히 허가받은 매립지에 묻거나 적절한 가연성물질과 혼합한 후에 허가받은 소각장치에서 소각할 것\n빈 용기는 제독(decontamination)하며, 용기를 세척하고 파기할 때까지 라벨의 모든 안전 규칙을 지킬 것",
    },
  },
  {
    Keyword: "Ascorbic acid",
    Name: "Ascorbic acid",
    ReagentProperty: {
      id: "603a292a4aa7b20a54f22d44",
      casNo: "50-81-7",
      formula: "C6H8O6",
      molecularWeight: "176.12",
      meltingpoint: "191dec °C",
      boilingpoint: null,
      density: "1.65 g/cu cm at 25 °C",
    },
    MaterialSafety: {
      id: "6037dd0f4aa7b2889bcda640",
      casNo: "50-81-7",
      phyStatus:
        "액체 몰부피 : 0.12 m3/kmol\n아스코르브산은 건조한 상태에서 안정하지만 수용액속에서 쉽게 산화됨. 산화는 가열, 빛, 알칼리류, 산화효소 등에 의해 가속화됨\n비교적 강한 환원력을 가지며, 많은 염료를 탈색하고, 안정한 금속염을 형성함\nIR: 470 (Ascorbic acid (D+))\nUV: 3455 (Ascorbic acid (D+))\nNMR: 3126 (Ascorbic acid (D+))\nMASS: 838 (Ascorbic acid (D+))\n자연발화점(°C) : 660 °C",
      phyColor: "흰색에서 연한 노란색",
      phySmell: "자료없음",
      phyTaste: "좋은, 자극적인 신맛",
      NFPAHealthNum: "1",
      NFPAFireNum: "0",
      NFPAReactionNum: "0",
      NFPASpecialNum: "자료없음",
      NFPAHealth: "1 (약간 유해한 물질(호흡장치를 착용하는 것이 좋음))",
      NFPAFire: "0 (연소성이 없는 물질)",
      NFPAReaction: "0 (화재에 노출되어도 안전, 물과 반응하지 않는 물질)",
      NFPASpecial: "이용 가능하지 않음",
      safReaction:
        "L-아스코르브산(L-ascorbic acid)은 락톤(lactone)임. 비교적 강환원제로써 반응하고 많은 염료를 탈색함. 안정한 금속 염을 형성함. 산화제, 염료, 알칼리, 철 및 구리와 혼합금지 해야 함. 또한 제2철의 염 및 중금속의 염, 특히 구리, 아연 및 망간과 혼합금지 해야 함 (NTP, 1992)\n아스코르브산(ascorbic acid) 주사는 많은 약물과 혼합금지 되어야 한다고 기록되어짐. 몇몇의 요소에 따라 양립 가능함 (예, 약물의 농도, pH, 온도에 따른 특정한 희석액의 사용)",
      safCorrosion: "자료없음",
      safAvoid:
        "아스코르브산(ascorbic acid) 주사는 많은 약물과 혼합금지 되어야 한다고 기록되어짐. 몇몇의 요소에 따라 양립 가능함 (예, 약물의 농도, pH, 온도에 따른 특정한 희석액의 사용)\n점화의 위험이 있으므로 산화제에 의한 오염을 피해야 함 즉 질산염(nitrates), 산화성산(oxidising acids), 염소 표백제(chlorine bleaches), 염소계 살균제(pool chlorine) 등",
      humNormal:
        "증상: 이 화합물에 노출시 증상은 피부, 눈, 기도 자극을 포함할 수 있음\n다량 섭취 시 위창자고통, 설사를 야기할 수 있음\n노출은 신장 수산칼슘 결석의 형성을 야기할 수 있음\n습진, 두드러기, 천식등의 알레르기 반응을 보이는 경우도 있음\n이 화합물의 점액용해증상은 정자가 덜 투과할 수 있는 자궁목점액을 만들수 있음\n급성/만성 유해성 : 이 화합물은 피부, 눈 및 기도의 자극을 유발할 수 있음\n가열되면서 분해될 때 매캐한 연기와 자극적인 흄이 발생함",
      humInhale:
        "호흡기도 자극성을 유발할 수 있음\n일반적인 산업적 용도로 취급시, 유해성이 낮음\n이 물질은 일부 사람들에게 호흡기 자극을 야기할 수 있음\n자극에 대한 신체 반응은 폐 손상의 원인이 될 수 있음\n호흡기능 장애, 기도 질병, 폐기종 또는 만성기관지염 같은 증상이 있는 사람일 경우, 많은 양의 분진을 흡입하면 증상이 더 악화될 수 있음\n만약 순환계 또는 중추 신경계에 피해를 입었거나 신장 손상이 지속된다고 여겨지고 물질의 취급 과정에서 더 많은 양에 노출된다면 적절한 검사가 이루어져야 함\n제품의 비휘발성 특성 때문에 일반적으로는 유해하지 않음",
      humSkin:
        "피부 자극을 유발할 수 있음\n보통 공업용으로 다룰 경우 위험도가 낮음\n이 물질은 일부사람에게 있어, 피부 접촉 즉시 피부염을 유발시킬 수 있음\n이 물질은 기존 피부염의 증상을 악화시킬 수 있음\n피부 접촉은 유해한 건강 영향을 유발시키지 않는 것으로 간주함(동물 모델을 이용한 EC Directives 분류 기준으로서); 이 물질은 상처, 외상, 찰과상을 입은 부분을 통해 침투되면 건강 손상을 유발시킬 수 있음\n이 물질을 베인 상처, 찰과상 또는 자극을 일으킨 피부에 노출시키지 말 것\n베임, 찰과상 또는 환부를 통하여 혈액 속에 들어갈 경우, 유해한 영향과 함께 전신 손상을 유발할 수 있음\n물질 사용에 앞서, 피부를 검사하고, 모든 외상으로 부터 적절히 보호할 것",
      humEye:
        "눈 자극을 일으킬 수 있음\n이 물질은 일부 사람에게 눈 자극 및 손상을 일으킬 수 있음",
      humMouth: "자료없음",
      humEtc: "자료없음",
      emeInhale:
        "즉시 오염된 지역에서 옮긴 후 신선한 공기로 호흡을 하게할 것\n기침이나 호흡 곤란, 입, 후두나 가슴이 타는 듯한 느낌 등과 같은 증상이 있으면 즉시 의사를 호출하고, 병원으로 환자를 옮길 준비를 할 것\n확인되지 않은 대기조건에서, 환자를 구조하는 경우 적절한 호흡 보호 장치를 제공할 것\n자체 내장 호흡 장치를 사용가능하다면 사용하고, 그렇지 않은 경우에는 보호의에 권고된 이상의 보호 단계로 조치할 것\n노출을 피해 즉시 신선한 공기가 있는 곳으로 이동시킬 것\n숨을 쉬지 않는다면 인공호흡을 실시할 것\n호흡이 곤란하면, 산소를 공급할 것\n기침을 하거나 기타 추가적인 증상이 있으면 의학적 조치를 받을 것",
      emeSkin:
        "오염된 옷을 제거하고 격리하는 동안, 즉각 다량의 물로 노출된 피부를 씻어낼 것\n모든 노출 부위를 비누와 물로 천천히 씻어낼 것\n홍반이나 자극과 같은 증상이 없더라도 즉시 병원이나 중독관리센터에 전화를 할 것\n노출된 부위를 씻은 뒤, 치료를 위해 환자를 병원으로 즉시 옮길 것\n다량의 물과 비누를 사용하여 적어도 15분 정도 씻어내고 오염된 옷과 신발을 제거할 것\n만약 자극이 있거나 지속되면, 의학적 조치를 받을 것\n옷은 재사용 전에 세탁할 것",
      emeEye:
        "맨 먼저 노출 환자의 콘택트 렌즈 착용여부를 확인하고 착용 시 제거할 것\n환자의 눈을 물 또는 생리식염수로 20-30분간 씻어줌과 동시에 병원 또는 응급의료센터에 연락을 취할 것\n의사의 지시가 없이 연고, 오일 또는 다른 약물적 처치를 하지 말 것\n홍반이나 자극과 같은 증상이 없더라도, 환자의 눈을 씻어낸 후, 즉시 병원으로 환자를 옮길 것\n눈꺼풀을 들어내고 적어도 15분 동안 많은 양의 물로 완전히 눈을 세척하고 눈꺼풀을 위아래로 움직일 것\n자극이 유발되면 치료를 받을 것",
      emeMouth:
        "구토를 유도하지 말 것\n환자가 의식이 있으면서 경련하지 않으면, 화학물질을 희석하기 위해서 물을 1 내지 2잔을 주고, 즉시 병원이나 중독관리센터에 전화할 것\n의사의 권고가 있었다면, 환자를 병원으로 이송할 준비를 할 것\n만약 환자에게 경련이 있거나 의식이 없으면, 입으로 어떤 것도 공급해서는 안 되고, 환자의 기도를 열고, 한쪽 옆으로 머리를 몸 보다 낮게 하여 눕힐 것\n즉시 환자를 병원으로 수송할 것\n의식이 없다면 절대 어떤 것도 주지 말 것\n의식이 있거나 정신이 명료하면, 입안을 헹구고 우유 또는 물을 2~4컵 마시게 할 것\n입안을 물로 씻어낼 것\n자극이나 증상이 발생하면 의학적 조치를 취할 것",
      emeEtc: "자료없음",
      accLeakage:
        "적절한 보호장비를 착용하고 유출된 물질을 즉시 청소할 것\n분진 발생 조건을 피할 것\n조심히 모아서 적절한 처리 용기에 넣을 것\n환기시킬 것\n비활성 환경 하에 놓을 것\n소규모 유출-모든 점화원을 제거할 것-젖은흙, 젖은모래 또는 비가연성 물질로 덮을 것-깨끗하고 스파크가 일어나지 않는 도구를 사용하여 흡수된 물질을 모을 것-적절한 장갑과 보안경을 착용할 것\n대규모 유출-사람들의 접근을 막고 풍상지역(맞바람이 부는 곳)으로 이동할 것 -소방서에 신고하여 위치와 위험성을 알릴 것-모든 점화원을 제거할 것(흡연, 불꽃, 스파크나 화염)-만약 안전하게 할 수 있다면 누출을 멈추게 할 것-수로, 하수, 지하실 또는 밀폐된 장소로 들어가는 것을 방지할 것-격렬하고 폭발적인 반응이 일어날 수 있음-유출된 물질 위를 걷지 말 것-적절한 보호의 착용 없이 손상된 용기나 유출된 물질을 만지지 말 것-젖은흙, 젖은모래 또는 비가연성 물질로 덮을 것-흡수된 물질은 처리를 위해 깨끗하고 스파크가 발생하지 않는 도구를 사용하여 뚜껑이 있는 금속 또는 플라스틱 용기에 수거할 것-유출은 건토, 건사 또는 질석을 사용해서 수거하고, 교대로 높은 끊는점을 가진 미네랄 오일로 덮을 것-스파크가 발생하지 않는 기구를 이용해 액체를 복구하고, 라벨이 붙은 밀봉한 용기에 넣어 둘 것-증기를 줄이거나 증기구름의 이동을 돌리기 위해 물 스프레이를 사용할 것-누출 지역을 청소하고 차후 처리를 위해 제방을 쌓고 배수로 흘러들어-지 않도록 할 것-오염지역을 청소한 처리수가 하수구로 흘러 들어가지 않도록 주의할 것-만약 하수나 수로에 오염이 발생했다면 비상 대응기관에 알리고 자문을 구할 것",
      accFire:
        "화재가 발생할 경우 분말 소화약제, 이산화탄소 혹은 할론 소화약제를 사용하여 소화시킬 것\n물 스프레이 또한 소화에 사용될 수 있음\n이 물질을 다룰 때에는 자급식 공기호흡기와 완전밀폐형 보호복을 착용할 것\n녹는 물질을 다룰 때에는 언제나 열 보호복를 착용 할 것\n구조적으로 소방관용 보호복의 경우 제한적인 보호수준을 제공함\n소방서에 신고하여 화재위치와 위험성을 알릴 것\n호흡보호구가 장착된 전신 보호복을 착용할 것\n모든 수단을 동원해, 수로나 배수구로의 유출을 차단할 것\n대피를 고려할 것 (혹은 보호 할 것)\n안전거리를 유지하며 적절한 보호 하에 화재를 진압할 것\n만약 안전하게 할 수 있다면 증기로 인한 화재 위험이 제거 될 때 까지 전기 장치들의 스위치를 꺼둘 것\n미세한 물분무로 화재를 진압하고 인접 지역을 냉각시킬 것\n누출액체가 고여있는 웅덩이에 물을 뿌리지 말 것\n뜨거울 것으로 의심되는 용기에는 접근하지 말 것\n화재에 노출된 용기는 안전 지역에서 물 스프레이를 이용하여 냉각시킬 것\n만약 안전하게 할 수 있다면 용기는 화재진행 경로에서 제거할 것\n화재 진압 시 사용된 장비는 반드시 소독하여 보관할 것",
      treStorage:
        "서늘하고 건조하고 통풍이 잘 되는 장소에서 혼합금지물질과 떨어진 곳에 저장할 것\n공기에 노출시키지 말 것\n빛을 피해서 저장할 것\n아르곤이나 질소 같은 불활성 기체상태 하에서 저장할 것\n소량일 때 : -실내 내화성 보관함이나 불연성 물질로 이루어진 방에 저장할 것 간단한 소화기를 저장소에 배치할 것\n여러 개일 때-승인된 화염 보호 구역에서 원래의 용기에 저장할 것-금연하고 갓이 없는 등, 열이나 점화원은 제거할 것-구덩이나 움푹 파인 땅, 지하실 등 증기가 갇힐 수 있는 곳에 저장하지 말 것-용기를 안전하게 밀폐시킬 것-서늘하고 건조하고 통풍이 잘 되는 장소에서 혼합금지물질과 떨어진 곳에 저장할 것-물리적 손상으로부터 용기를 보호하고 정기적으로 누수를 확인할 것-날씨에 노출되지 않도록 하며 직사광선을 피해 용기를 보호할 것, 그렇지 않으면 : (a) 금속이나 플라스틱으로 포장할 것,  (b) 안전하게 밀폐해야 하고 저장소에서 열지 말 것, (c) 위험물질로 오염된 빗물을 안전하게 모아서 버릴 수 있도록 예방조치를 마련할 것-위험물질이 오랫동안 저장되는 것을 막기 위해 적절한 재고 조절 측정이 필요함-저장 및 취급 시, 제조자의 권고사항을 살펴볼 것",
      treTreatcaution:
        "오염된 옷은 버리고 재사용하기 전에 세척할 것\n분진 발생과 분진 축적을 최소화 할 것\n옷과 접촉하지 않도록 할 것\n용기를 완전히 밀폐시킬 것\n적절한 환기장치를 사용할 것\n빛을 피해서 저장할 것\n불활성 대기상태 하에서 취급할 것\n공기를 피해 저장할 것\n대규모 또는 연속적으로 사용하는 경우, 스파크가 없는 통풍 장치 배출구가 외부에 직접 접지되고 일반적인 통풍 장치로부터 분리할 것\n폭발 배출구가 있는 집진기를 설치할 것\n흡입을 포함한 모든 인체 접촉은 피할 것\n노출 위험이 발생할 때, 보호의를 착용할 것\n통풍이 잘 되는 장소에서 사용할 것\n흡연, 직사광선이나 점화원을 피할 것\n혼합금지물질과 접촉시키지 않을 것\n취급 시 먹거나 마시거나 흡연하지 말 것\n사용하지 않을 때에는 용기를 안전하게 밀폐시킬 것\n용기에 물리적인 위험을 피할 것\n취급 후에는 항상 비누와 물로 손을 씻을 것\n적합한 작업장을 사용할 것\n저장 및 취급 시, 제조자의 권고사항을 살펴볼 것\n안전한 작업환경을 유지하기 위하여 대기 노출 기준을 준수할 수 있도록 공기질을 정기적으로 확인할 것\n주 : 이 물질은 공기로부터 산소를 제거할 수 있으므로, 물질이 축적되어 있는 밀폐된 공간이나 제한된 공간에서 작업자들에게 심각한 위험을 발생시킬 수 있음 이러한 구역에 들어가기 전에 샘플을 채취하여 저산소 농도를 테스트할 것 - 적절한 산소 공급이 이루어 지도록 조절할 것\n빈 용기에 잔류물질은 바닥에 쌓여서 축적될 수 있음 이러한 잔류물질은 적당한 점화원이 존재하는 경우에 폭발할 수도 있음 그러한 용기에 절삭, 천공, 연마 또는 용접을 해서는 안됨 그러한 행위들이 적절한 작업 안전 승인 또는 허가 없이 용기 근처(차있거나 부분적으로 차있거나 비어 있는 용기)에서 수행되면 안됨<저장시 주의사항>\n강산류와 강염기류를 피할 것\n산화제류와의 반응을 피할 것",
      treDisposal:
        "폐기방법 : 폐기물관리법에 명시된 경우 규정에 따라 내용물 및 용기를 폐기하시오.\n폐기 시 주의사항 : 폐기물관리법에 명시된 경우 규정에 명시된 주의사항을 고려하시오.\n빈 용기에도 남아있는 물질로 인한 화학적 유해성이나 위험성이 존재할 수 있음\n가능하다면 재사용/재활용을 위해 공급자에게 반환할 것\n다른 경우 : 만약 다 쓴 빈 용기를 잔여물 없이 충분히 깨끗하게 세정할 수 없거나 동일물질을 저장하는데 사용할 수 없다면, 재사용을 막기 위해 용기에 구멍을 뚫고 허가된 매립지에 매립할 것\n가능한 라벨의 경고문과 MSDS 등 제품 내 딸려있는 모든 고지사항을 준수할 것\n폐기물 처리 요건에 대한 법은 나라, 지역마다 다를 수 있음\n사용자는 그 지역의 법을 따라야 함 일부 지역에서는 특정 폐기물에 대한 추적이 행해지고 있음\n규제의 체계는 일반적일 것으로 보이며, 사용자의 조사가 필요함 :-환원-재사용-재활용-폐기(앞의 항목들이 가능하지 않은 경우)\n사용하지 않았거나 오염되지 않은 물질의 경우 재활용이 가능할 수 있음 물질의 유효기간을 고려하여 재활용 및 재생 여부를 결정할 것 물질의 성질은 사용 중 변할 수 있으며, 재사용 또는 재활용이 항상 적절한 것이 아닐 수 있음\n장비세척 시 생성된 세척수를 하수구로 흘려보내지 말 것\n폐기 전에 처리로 인한 세척수를 수거할 필요성이 있을 수도 있음\n하수구로 폐기 시 그 지역의 법이나 규정에 적합한지 가장 먼저 고려할 것 의심스러울 경우 관련 당국 책임자에게 문의할 것\n가능한 재활용하고, 재활용 방법에 대해서는 제조사에 문의할 것\n처리를 위해 지역 폐기물 책임자에게 자문을 구할 것\n잔류물은 승인된 장소에서 매립 또는 소각할 것\n가능하다면 용기는 재활용하고, 처리 시는 인가된 매립지에 묻을 것",
    },
  },
];
// console.log(result.length);
// console.log(result[1]);

function printOneDictResult(varName, resultName) {
  console.log(`VarName : ${varName}, resultName : ${resultName}`);
}
function printAllDictResult(result) {
  for (let i in result) {
    printOneDictResult(i, result[i]);
  }
  console.log("Trasfer Success!!");
}

function splitResult(sample) {
  const allResult = [];
  for (let i = 0; i < sample.length; i++) {
    let result = {
      reagentName: sample[i].Name,
      casNo: sample[i].ReagentProperty.casNo,
      formula: sample[i].ReagentProperty.formula,
      molecularWeight: sample[i].ReagentProperty.molecularWeight,
      meltingpoint: sample[i].ReagentProperty.meltingpoint,
      boilingpoint: sample[i].ReagentProperty.boilingpoint,
      density: sample[i].ReagentProperty.density,
      MaterialSafety: "Temporaily Empty!",
    };
    console.log("Parsing Success!!");
    printAllDictResult(result);

    allResult.push(result);
  }
  // console.log(allResult);

  return allResult;
}
