[
    {
        "cas_no": "75-31-0",
        "물리화학적 성질:상태": "액체",
        "물리화학적 성질:색상": "무색",
        "물리화학적 성질:냄새": "5.0X10-4 ppm\n5.0X10-4 ppm (최저 취기한계)\n0.48 ppm (최고 취기한계)",
        "물리화학적 성질:맛": "자료없음",
        "NFPA 위험성 코드:건강위험성 percent": "3",
        "NFPA 위험성 코드:화재위험성 percent": "4",
        "NFPA 위험성 코드:반응위험성 percent": "0",
        "NFPA 위험성 코드:특수위험성 percent": "자료없음",
        "NFPA 위험성 코드:건강위험성": "(매우 유해한 물질(노출된 지역에 들어가기 위해서는 매우 조심해야 함))",
        "NFPA 위험성 코드:화재위험성": "(인화성이 큰 기체, 휘발성이 큰 인화성 액체, 공기에 분산된 분진상태에서 폭발서잉 큰 물질)",
        "NFPA 위험성 코드:반응위험성": "(화재에 노출되어도 안전, 물과 반응하지 않는 물질)",
        "NFPA 위험성 코드:특수위험성": "자료없음",
        "안전\/반응 위험 특성:반응성(안전성, 산화성)": "1-chloro-2,3-epoxypropane 및 아민(amine), 대부분의 기타 질소염 물질들과 반응시 격렬한 발열반응을 일으킴\n산, 알데하이드(aldehydes), 케톤(ketones), 에폭사이드(epoxides) 및 산화재와 반응함\n빠른 혼합 및 약한 냉각, 유도기간을 다르게 하면서 서서히 가열시 빠르고 격렬한 발열반응을 일으킴(350 ℃\/6초)\n0 ℃ 이하에서 희석액 존재시, 퍼클로릴플로라이드(perchlorylfluroide), 아이소프로필아민(isopropylamine) 또는 아이소부틸아민(isobutylamine)의 상호작용은 폭발성 액체를 형성함",
        "안전\/반응 위험 특성:부식성": "삼켰을 경우 위해함\n위장에 화상을 일으킴\n중추신경계 영향을 유발할 수 있음\n사고로 섭취한 경우는 위해함; 동물 실험 결과 150g 미만의 섭취는 치명적이거나 건강에 매우 심한 손상을 주었음\n섭취후, 구강과 위장에 화상을 일으킬 수 있음\n벤젠고리가 없는 아민류는 삼켰을 경우 장으로 흡수됨\n부식성으로 인해 위장 전체가 손상될 수 있음\n이 물질은 효소붕괴로 인해 간, 신장, 위장점막에서 제거됨",
        "안전\/반응 위험 특성:피해야 할 조건": "물, 산, 알칼리(alkalis), 암모니아(ammonia), 과염소산염(chloryl perchlorate)\n강산, 산 염화물, 산 무수물과 피해야 함\n구리, 알루미늄, 그 합금들과 접촉을 피해야 함\n산화제와 반응을 피해야 함",
        "인체 유해성:일반 증상": "흡입은 코와 인후 자극, 심한 기침, 가슴통증, 폐부종, 의식잃음을 일으킴\n삼키면 메스꺼움, 타액분비, 구강과 위의 심한 자극을 일으킴\n안구 접촉은 심한 자극과 각막부종을 일으킴\n피부 접촉은 심한 자극을 일으킴\n눈, 피부, 코, 인후 자극; 폐부종; 시각장애; 눈, 피부 화상, 피부염",
        "인체 유해성:흡입": "액체 미스트의 다량 흡입은 극도로 위험할 수 있고 경련, 후두와 기관지의 극심한 자극으로 인해 치명적일 수 있음\n아민 증기의 흡입은 코와 인후의 점막 자극과 호흡곤란과 기침을 동반하는 폐 자극을 일으킬 수 있음\n심한경우 두통, 메스꺼움, 실신, 불안증과 함께 호흡기 팽창과 염증이 보여짐\n천식이 나타날 수 있음\n인후염, 기침, 작열감, 숨가쁨, 호흡곤란\n증상은 지연되어 나타날 수 있음",
        "인체 유해성:피부": "피부로 흡수시 유해함\n심각한 피부자극 및 화상을 유발함\n장기 또는 반복 피부접촉 시 피부염을 유발할 수 있음\n피부자극 및 화상을 일으킴",
        "인체 유해성:안구": "눈자극 및 화상을 일으킴\n저농도 증기는 '청색 혼탁' 또는 '후광 비전'이라고 알려진 일시적 시야방해를 일으킬 수 있음\n증기가 눈 조직에 흡수되면 눈물, 결막염, 각막 부종을 일으킴\n액체와 직접 접촉시 눈이 멀거나 또는 영구적인 눈손상을 일으킬 수 있음",
        "인체 유해성:경구": "삼켰을 경우 위해함\n위장에 화상을 일으킴\n중추신경계 영향을 유발할 수 있음\n사고로 섭취한 경우는 위해함; 동물 실험 결과 150g 미만의 섭취는 치명적이거나 건강에 매우 심한 손상을 주었음\n섭취후, 구강과 위장에 화상을 일으킬 수 있음\n벤젠고리가 없는 아민류는 삼켰을 경우 장으로 흡수됨\n부식성으로 인해 위장 전체가 손상될 수 있음\n이 물질은 효소붕괴로 인해 간, 신장, 위장점막에서 제거됨",
        "인체 유해성:기타": "자료없음",
        "응급 조치 요령:흡입": "즉시 오염 지역을 벗어나, 신선한 공기로 깊게 호흡하게 할 것\n기침이나 호흡 곤란, 입, 후두나 가슴이 타는 듯한 느낌 등과 같은 증상이 있으면 즉시 의사를 호출하고, 병원으로 환자를 옮길 준비를 할 것\n구강 대 구강 인공호흡은 피할 것\n호흡 정지 시, 산소와 백 및 마스크와 같은 적절한 의학 장비를 이용하여 인공호흡을 실시할 것\n잘모르는 조건으로 들어가, 피해자를 구조하는 경우 적절한 호흡 보호 장치를 제공할 것\n자급식 공기호흡기를 사용가능하다면 사용하고, 그렇지 않은 경우에는 보호의에 권고된 이상의 보호 단계로 조치할 것",
        "응급 조치 요령:피부": "즉시 오염된 옷을 제거하며 피부를 물로 씻어낼 것\n모든 노출 부위를 비누와 물로 천천히 씻어낼 것\n오염된 신발은 버릴 것\n추가적인 노출을 막기 위해 감염된 옷을 벗을 것\n홍반이나 자극과 같은 증상이 없더라도 즉시 병원이나 응급 센터에 전화를 할 것\n피부에 노출된 부분을 씻은 뒤 치료를 위해 환자를 병원으로 즉시 옮길 것",
        "응급 조치 요령:안구": "우선, 피해자의 콘택트 렌즈 착용여부를 확인하고 착용 시 제거할 것\n피해자의 눈을 물 또는 생리식염수로 20-30분간 씻어주면서, 동시에 병원 또는 중독 관리 센터에 연락을 취할 것\n의사의 지시가 없이, 피해자의 눈에 연고, 오일 또는 다른 약물을 투여하지 말 것\n피해자가 눈을 비비거나 눈을 계속 감고 있지 못하게 할 것\n홍반이나 자극과 같은 증상이 없더라도, 눈을 씻어낸 후, 즉시 병원으로 피해자를 옮길 것",
        "응급 조치 요령:경구": "구토를 유도하지 말 것\n부식성 화학물질은 입, 목, 식도의 점막을 파괴할 수 있으며, 휘발성 화학물질은 구토를 하는 동안에 폐로 흡인될 위험성이 높음. 이는 휘발성이 있는 부식성 화학물질의 구토를 유도함으로 발생할 수 있는 의학적 문제를 증가시킬 수 위험성이 매우 높음\n피해자가 의식이 있으면서 경련하지 않으면, 화학물질을 희석하기 위해서 물을 1내지 2잔을 주고, 즉시 병원이나 중독관리센터에 전화할 것\n환자가 경련을 일으키거나 의식을 잃었다면, 아무것도 먹이지 말고, 환자의 기도가 열려있는지 확인한 후, 머리를 몸보다 낮게 하여 옆으로 눕힐 것\n피해자를 즉시 병원으로 이송할 것",
        "응급 조치 요령:기타": "자료없음",
        "사고 대응 정보:누출방제요령": "모든 발화원을 제거할 것(흡연, 불꽃, 스파크나 화염)\n제품 취급 시 사용하는 모든 장비는 반드시 접지할 것\n누출된 물질위를 걷거나 만지지 말 것\n만약 위험하지 않다면 누출을 멈추게 할 것\n적절한 보호장구를 사용하여 누출물질을 즉시 치울 것\n수로, 하수, 지하실 또는 밀폐된 장소로 들어가는 것을 방지할 것\n비활성물질 (예,건토, 건사)에 흡수시킨 후 화학물질 폐수거 용기에 수거할 것\n증기발생을 줄이기 위해 증기억제 폼(foam)을 사용할 수 있음\n화재가 없는 누출 및 유출 사고 시에는 증기노출을 막을 수 있는 완전 밀폐형 보호의를 착용할 것\n화재 진압 시 물 스프레이의 사용이 증기를 줄일 수는 있으나 닫힌 공간에서의 발화는 막을 수 없음\n환기 시킬 것\n소규모 누출-건토, 건사 또는 비가연성 물질로 덮어 흡수시킨 후 용기에 수거하여 옮길 것-흡수된 물질을 모으기 위해 스파크가 일어나지 않는 깨끗한 도구를 사용할 것\n대규모 누출-액체누출의 경우 처리를 위해 도랑을 파거나 제방을 쌓을 것-화재 진압 시 물 스프레이의 사용이 증기를 줄일 수는 있으나 닫힌 공간에서의 발화는 막을 수 없음",
        "사고 대응 정보:화재진압요령": "소방서에 신고하여 화재위치와 위험성을 알릴 것\n다량의 안개형 물 분무를 사용할 것\n화재에 노출된 용기는 다량의 물로 냉각시킬 것\n알코올포, 분말소화약제 또는 이산화탄소를 사용할 것\n미세한 물분무로 화재를 진압하고 인접 지역을 냉각시킬 것\n화재에 노출된 용기는 안전 지역에서 물 스프레이를 이용하여 냉각시킬 것\n직수 분사는 소화에 효력이 없을 수 있음\n호흡보호구가 장착된 전신 보호복을 착용할 것\n대피를 고려할 것 (혹은 보호 할 것)\n유출을 멈추게 할 수 없다면 소화시도 하지 말 것\n가능한 멀리서 물을 뿌릴 것\n모든 수단을 동원해, 수로나 배수구로의 유출을 차단할 것\n안전거리를 유지하며 적절한 보호 하에 화재를 진압할 것\n만약 안전하게 할 수 있다면 증기로 인한 화재 위험이 제거 될 때 까지 전기 장치들의 스위치를 꺼둘 것\n누출액체가 고여있는 웅덩이에 물을 뿌리지 말 것\n뜨거울 것으로 의심되는 용기에는 접근하지 말 것\n만약 안전하게 할 수 있다면 용기는 화재진행 경로에서 제거할 것\n화재 진압 시 사용된 장비는 반드시 소독하여 보관할 것\n격렬하게 또는 폭발적으로 반응할 수 있음",
        "취급 주의 정보:취급 및 저장 방법": "강철용기에 저장할 것\n승인된 화염 보호 구역에서 원래의 용기에 저장할 것\n확실하게 밀폐된 용기에 저장할 것\n냉장보관할 것 (약 4℃)\n서늘하고 건조하고 통풍이 잘 되는 장소에서 피해야 할 물질과 떨어진 곳에 저장할 것\n구덩이나 움푹 파인 땅, 지하실 등 증기가 갇힐 수 있는 곳에 저장하지 말 것\n열, 스파크, 화염과 가까이 두지 말 것\n연기, 직사광선, 열이나 발화원이 없어야 함\n물리적 손상으로부터 용기를 보호하고 정기적으로 누수를 확인할 것\n저장 및 취급시, 제조자의 권고사항을 살펴볼 것",
        "취급 주의 정보:취급시 주의사항": "통풍이 잘 되는 장소에서만 사용할 것\n움푹한 곳에 모이지 않도록 할 것\n적합한 작업장을 사용할 것\n열, 스파크, 화염, 연기, 직사광선, 발화원을 피할 것\n피해야 할 물질과 접촉시키지 않을 것\n물질을 이동시킬 때 용기를 땅에 밀착하여 이동할 것\n제품을 나누거나 쏟아부을 때, 금속용기를 접지하여 안전하게 할 것\n취급시 스파크가 없는 도구를 사용할 것\n플라스틱 용기를 사용하지 말 것\n용기를 완전히 밀폐시킬 것\n용기에 물리적인 위험을 피할 것\n대기압이 확인되지 않은 상태에서 밀폐된 공간으로 들어가지 말 것\n흡입을 포함한 모든 인체 접촉을 피할 것\n취급 후, 손을 철저하게 씻을 것\n물질을 취급시, 축축한 옷을 착용해서는 안됨\n노출 위험이 발생할 때, 보호의를 착용할 것\n오염된 옷은 버리고 재사용하기 전에 세척할 것\n작업복은 분리하여 세탁할 것\n빈 용기라도 폭발성 있는 증기를 포함하고 있을 수 있음.\n용기 근처에서 가압, 절단, 용접, 납땜, 연마, 천공 등의 행위를 해서는 안됨\n끓는점이 낮은 물질을 포함하는 경우 : 적절하지 않은 용기의 경우 격렬한 파열을 일으킬 수 있으므로 밀봉된 용기에 저장할 것\n용기가 볼록해 지는지 확인할 것\n정기적으로 배출시킬 것\n항상 마개를 풀어주거나 느리게 증기를 소실시키기 위해서 천천히 밀봉할 것\n증기상물질은 끌어올리거나 쏟아부을 때, 정전기로 인해 발화될 수 있음\n저장 및 취급시, 제조자의 권고사항을 살펴볼 것\n안전한 작업환경을 유지하기 위하여 대기 노출 기준을 준수할 수 있도록 공기질을 정기적으로 확인할 것",
        "취급 주의 정보:폐기시 주의사항": "빈 용기에도 남아있는 물질로 인한 화학적 유해성이나 위험성이 존재할 수 있음\n가능하다면 재사용\/재활용을 위해 공급자에게 반환할 것\n다른경우 : 만약 다 쓴 빈 용기를 잔존물 없이 충분히 깨끗하게 세정할 수 없거나 동일물질을 저장하는데 사용할 수 없다면, 재사용을 막기 위해 용기에 구멍을 뚫고 허가된 매립지에 매립할 것\n가능한 라벨의 경고문과 MSDS 등 제품 내 딸려있는 모든 고지사항을 준수할 것\n폐기물 처리 요건에 대한 법은 나라, 지역마다 다를 수 있음\n사용자는 그 지역의 법을 따라야 함. 일부 지역에서는 특정 폐기물에 대한 추적이 행해지고 있음\n규제의 체계는 일반적일 것으로 보여지며, 사용자의 조사가 필요함\n환원\n재사용\n재활용\n폐기 (앞의 항목들이 가능하지 않은 경우)\n사용하지 않았거나 오염되지 않은 물질의 경우 재활용이 가능할 수 있음. 만약 오염되었다면 여과, 증류 또는 다른 방법들을 통해서 재생이 가능할 수 있음. 물질의 유효기간을 고려하여 재활용 및 재생 여부를 결정할 것. 물질의 성질은 사용중 변할 수 있으며, 재사용 또는 재활용이 항상 적절한 것이 아닐수 있음\n장비세척 시 생성된 세척수를 하수구로 흘려보내지 말것\n폐기 전에 처리로 인한 세척수를 수거할 필요성이 있을 수도 있음\n하수구로 폐기시 그 지역의 법이나 규정에 적합한지 가장 먼저 고려할 것. 의심스러울 경우 관련 당국 책임자에게 문의할 것.\n의문사항은 책임자와 상의할 것\n가능한 재활용할 것\n만약 적합한 처리방법이나 처리 시설이 없다면 제조업자에게 재활용 방안에 대해 문의하거나 지역 폐기물 관리 당국자에게 자문을 구할것\n인가된 처리시설에서 중화시켜 처리할것\n처리 방법 : 적절한 희석 산(dilute acid)으로 중화시킨 후 허가된 매립지에 매립 또는 승인된 시설에서 소각할 것\n빈 용기는 정화(decontamination) 할 것\n용기를 세척하고 파기할 때까지 라벨의 모든 안전 규칙을 지킬 것"
    }
]